IDEA Open Model
BoltGrid.AxisX Property
Compatible with IDEA StatiCa v 10.1
 Bolt grid LCS - Axis X
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public Vector3D AxisX { get; set; }
Public Property AxisX As Vector3D
	Get
	Set
public:
property Vector3D^ AxisX {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
BoltGrid Class
IdeaRS.OpenModel.Connection Namespace